tap "homebrew/cask"

# For development
cask "docker"
brew "node"
brew "python3"
brew "ruby"
brew "ruby-build"
brew "ghc"
brew "cabal-install"
brew "meson"
brew "ninja"

# Makes
brew "make"
brew "bmake"
brew "bsdmake"

# Shells for shell-dry-run
brew "bash"
brew "dash"
brew "ksh93"
brew "mksh"
brew "oksh"
brew "yash"
brew "zsh"

# Others
brew "libxml2"

# Haskell
brew "hadolint"

# No longer necessary below
# brew "checkmake"
# brew "circleci"
# brew "shellcheck"
# brew "shfmt"
